#include <stdint.h>
#include <stdbool.h>
#include <iso646.h>
#include "Fb2PosControl.h"

#define PV   p->PV
#define SP   p->SP
#define HYST p->HYST
#define OP   p->OP
#define ER   p->ER

void Fb2PosControl(struct Db2PosControl *p)
{

  //Ошибка регулирования.
  ER = SP - PV;

  //Регулятор двухпозиционный.
  if (ER >= HYST)
  {
    OP = true;
  }

  if (ER <= HYST * (-1.0))
  {
    OP = false;
  }

  return;
}

//Применение.
//
//Двухпозиционный регулятор используется как простейший регулятор температуры, давления, уровня.

// Условное графическое обозначение.
//
//      +---------------+
//      |               |
//      |    +--<--+--  |
//      |    |     |    |
// ER->-|    v     ^    |->-OP
//      |    |     |    |
//      |  --+-->--+    |
//      |               |
//      +---------------+

// Статическая характеристика.
//
//                 OP
//                  ^
//                  |
//           ***<***1***<******
//           *      |      *
//           v      |      ^
//           *      |      *
// -ER <--******>***0***>***--> +ER
//           |      |      |
//           |<---->|<---->|
//             HYST   HYST

// Временная характеристика.
//
// ^ PV,SP
// |         PV
// |----------*---------------*------
// |         * *             * *   |
// |        *   *           *   *  |  SP + HYST
// |       *     *         *       |
// |======*=======*=======*========== SP
// |     *         *     *         |
// |    *           *   *          |  SP - HYST
// |   *             * *           |
// |--*---------------*--------------
// | *
// |*
// +-----------------------------------------> t[s]
//
// ^ OP
// |
// 1***********       *********
// |          *       *       *
// 0----------*********-------***------------> t[s]

// Схема включения.
//
//                  +---------------+
//                  |               |   Объект управления
//                  |    +--<--+--  |     +-----------+
//        +---+ ER  |    |     |    | OP  |     K     |
// SP-->--| + |-->--|    v     ^    |-->--| --------- |-->--+-->PV
// PV  +--| - |     |    |     |    |     | T * s + 1 |     |
//     |  +---+     |  --+-->--+    |     +-----------+     |
//     |            |               |                       |
//     |            +---------------+                       |
//     |                                                    |
//     +----------------------------------------------------+

//  +---------+
//  | GNU GPL |
//  +---------+
//  |
//  |
//  .= .-_-. =.
// ((_/)o o(\_))
//  `-'(. .)`-'
//  |/| \_/ |\
//  ( |     | )
//  /"\_____/"\
//  \__)   (__/
// @COPYLEFT ALL WRONGS RESERVED :)
// Author: VA
// Contacts: DIY.PLC.314@gmail.com
// License: GNU GPL v2
